import torch
from TTS.api import TTS

# Get device
device = "cuda" if torch.cuda.is_available() else "cpu"

my_text ="""
हमारे महान राष्ट्र की प्रगति और विकास में आपका योगदान अतुलनीय है। आज, हम एक ऐसे मोड़ पर खड़े हैं जहाँ हमें एकजुट होकर चुनौतियों का सामना करना है और अवसरों का लाभ उठाना है। हमारी विविधता हमारी शक्ति है, और हमारी एकता हमारी ताक़त। आइए, हम सब मिलकर एक समृद्ध, सशक्त और समावेशी भारत के निर्माण के लिए संकल्प लें, जहाँ हर नागरिक को समान अवसर मिले और हमारा देश विश्व में एक नई ऊँचाई पर पहुँचे।
"""

api = TTS("tts_models/hin/fairseq/vits")
api.tts_to_file(
    my_text,
    file_path="output.wav"
)
